/************************************************
	柔微智能科技（苏州）有限公司
	描述：main.c的头文件
	作者：付佳伟
************************************************/
#ifndef SHELL_CONTROL_H
#define SHELL_CONTROL_H

/************************************************
	头文件
************************************************/
#include "shell.h"
#include <string.h>

/************************************************
	宏定义
************************************************/
#define software_VERSION "V2.1.2"
#define EN 1
#define NO 0

#define array_len 11

/************************************************
	外部调用函数声明
************************************************/
void shell_conteol_register(void);
void shell_control_explain(unsigned int* ID);
void aaa(void);


/************************************************
	外部调用变量
************************************************/

#endif
